In [50]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [51]:
%sql sqlite:///libraryDB.db

'Connected: @libraryDB.db'

# Create each of the tables from database design

**Here the "books" table is created with columns: bookID, title, publisher, releaseDate, isbn and borrowerID**

**The bookID column is the primary key, with borrowersID as a foreign key**

In [52]:
%%sql
DROP TABLE IF EXISTS books;
CREATE TABLE books (
    bookID INT NOT NULL UNIQUE,
    title VARCHAR(255) NOT NULL DEFAULT '',
    publisher VARCHAR(255) NOT NULL DEFAULT '', 
    releaseDate date NOT NULL DEFAULT '',
    isbn INT NOT NULL DEFAULT '', 
    branchID VARCHAR(255) NOT NULL DEFAULT '',
    CONSTRAINT branches FOREIGN KEY (branchID)
    REFERENCES branches(branchID)
    PRIMARY KEY (bookID)
);

SELECT *
FROM books

 * sqlite:///libraryDB.db
Done.
Done.
Done.

[]

**Here the "branches" table is created, with branchID as primary key**

In [53]:
%%sql
DROP TABLE IF EXISTS branches;
CREATE TABLE branches (
    branchID INT NOT NULL UNIQUE,
    name VARCHAR(255) NOT NULL DEFAULT '',
    address VARCHAR(255) NOT NULL DEFAULT '', 
    zipCode INT NOT NULL DEFAULT '',
    city VARCHAR(255) NOT NULL DEFAULT '',
    PRIMARY KEY (branchID)
);

SELECT * 
FROM branches

 * sqlite:///libraryDB.db
Done.
Done.
Done.

[]

**Here the "borrowers" table is created, with borrowerID as primary key**

In [54]:
%%sql
DROP TABLE IF EXISTS borrowers;
CREATE TABLE borrowers (
    borrowerID INT NOT NULL UNIQUE,
    firstName VARCHAR(255) NOT NULL DEFAULT '',
    lastName VARCHAR(255) NOT NULL DEFAULT '', 
    address VARCHAR(255) NOT NULL DEFAULT '',
    zipCode INT NOT NULL DEFAULT '',
    city VARCHAR(255) NOT NULL DEFAULT '', 
    email VARCHAR(255) NOT NULL DEFAULT '',
    phoneNumber INT NOT NULL DEFAULT '',
    PRIMARY KEY (borrowerID)
);

SELECT *
FROM borrowers

 * sqlite:///libraryDB.db
Done.
Done.
Done.

[]

**Here the "lentBooks" table is created, with two foreign keys, "bookID" and "borrowerID", which together will act as a primary key.**

In [55]:
%%sql
DROP TABLE IF EXISTS lentBooks;
CREATE TABLE lentBooks (
    bookID INT NOT NULL UNIQUE,
    dueDate date NOT NULL DEFAULT '',
    borrowerID INT NOT NULL DEFAULT '',
    CONSTRAINT borrowers FOREIGN KEY (borrowerID)
    REFERENCES borrowers(borrowerID)
    
    PRIMARY KEY (bookID)
    
);

SELECT *
FROM dueDate

 * sqlite:///libraryDB.db
Done.
Done.
(sqlite3.OperationalError) no such table: dueDate
[SQL: SELECT *
FROM dueDate]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

**Here the "author" table is created, with a primary key "author".**

In [56]:
%%sql
DROP TABLE IF EXISTS author;
CREATE TABLE author (
    authorID INT  NOT NULL UNIQUE,
    firstName varchar(255) NOT NULL DEFAULT '',
    lastName varchar(255) NOT NULL DEFAULT '',
    
    PRIMARY KEY (authorID)
);

SELECT *
FROM author

 * sqlite:///libraryDB.db
Done.
Done.
Done.

[]

**Here the "bookAuthor" table is created, with two foreign keys, "authorID" and "bookID"**

In [71]:
%%sql
DROP TABLE IF EXISTS bookAuthor;
CREATE TABLE bookAuthor (
    bookID INT NOT NULL DEFAULT '',
    authorID INT NOT NULL DEFAULT '',
    CONSTRAINT book FOREIGN KEY (bookID)
    REFERENCES book (bookID)
    CONSTRAINT author FOREIGN KEY (authorID)
    REFERENCES author (authorID)
    
);
    
SELECT *
FROM bookAuthor

 * sqlite:///libraryDB.db
Done.
Done.
Done.

[]

**Here the "bookBranches" table is created, with two foreign keys, "bookID" and "branchID"**

In [78]:
%%sql
DROP TABLE IF EXISTS bookBranches;
CREATE TABLE bookBranches (
    bookID INT NOT NULL DEFAULT '',
    branchID INT NOT NULL DEFAULT '',
    CONSTRAINT book FOREIGN KEY (bookID)
    REFERENCES book (bookID)
    CONSTRAINT branches FOREIGN KEY (branchID)
    REFERENCES branches (branchID)
    
);
    
SELECT *
FROM bookBranches

 * sqlite:///libraryDB.db
Done.
Done.
Done.

[]

In [59]:
%sql SELECT * FROM sqlite_master WHERE type='table' ORDER BY name;

 * sqlite:///libraryDB.db
Done.

[('table', 'author', 'author', 11, "CREATE TABLE author (\n    authorID INT  NOT NULL UNIQUE,\n    firstName varchar(255) NOT NULL DEFAULT '',\n    lastName varchar(255) NOT NULL DEFAULT '',\n    \n    PRIMARY KEY (authorID)\n)"),
 ('table', 'bookAuthor', 'bookAuthor', 13, 'CREATE TABLE bookAuthor (\n    bookID INT NOT NULL UNIQUE,\n    authorID INT NOT NULL UNIQUE,\n    CONSTRAINT book FOREIGN KEY (bookID)\n    REFERENCES book (bookID)\n    CONSTRAINT author FOREIGN KEY (authorID)\n    REFERENCES author (authorID)\n    \n)'),
 ('table', 'bookBranches', 'bookBranches', 16, 'CREATE TABLE bookBranches (\n    bookID INT NOT NULL UNIQUE,\n    branchID INT NOT NULL UNIQUE,\n    CONSTRAINT book FOREIGN KEY (bookID)\n    REFERENCES book (bookID)\n    CONSTRAINT branches FOREIGN KEY (branchID)\n    REFERENCES branches (branchID)\n    \n)'),
 ('table', 'books', 'books', 2, "CREATE TABLE books (\n    bookID INT NOT NULL UNIQUE,\n    title VARCHAR(255) NOT NULL DEFAULT '',\n    publisher VARCHAR(255) NOT NULL DEFAULT '', \ ... (89 characters truncated) ... hID VARCHAR(255) NOT NULL DEFAULT '',\n    CONSTRAINT branches FOREIGN KEY (branchID)\n    REFERENCES branches(branchID)\n    PRIMARY KEY (bookID)\n)"),
 ('table', 'borrowers', 'borrowers', 7, "CREATE TABLE borrowers (\n    borrowerID INT NOT NULL UNIQUE,\n    firstName VARCHAR(255) NOT NULL DEFAULT '',\n    lastName VARCHAR(255) NOT NULL DE ... (111 characters truncated) ... AR(255) NOT NULL DEFAULT '', \n    email VARCHAR(255) NOT NULL DEFAULT '',\n    phoneNumber INT NOT NULL DEFAULT '',\n    PRIMARY KEY (borrowerID)\n)"),
 ('table', 'branches', 'branches', 5, "CREATE TABLE branches (\n    branchID INT NOT NULL UNIQUE,\n    name VARCHAR(255) NOT NULL DEFAULT '',\n    address VARCHAR(255) NOT NULL DEFAULT '', \n    zipCode INT NOT NULL DEFAULT '',\n    city VARCHAR(255) NOT NULL DEFAULT '',\n    PRIMARY KEY (branchID)\n)"),
 ('table', 'lentBooks', 'lentBooks', 9, "CREATE TABLE lentBooks (\n    bookID INT NOT NULL UNIQUE,\n    dueDate date NOT NULL DEFAULT '',\n    borrowerID INT NOT NULL DEFAULT '',\n    CONSTRAINT borrowers FOREIGN KEY (borrowerID)\n    REFERENCES borrowers(borrowerID)\n    \n    PRIMARY KEY (bookID)\n    \n)")]

In [60]:
%%sql
INSERT INTO books (bookID, title, publisher, releaseDate, isbn, branchID)
VALUES (1, 'Absalom, Absalom!', 'RELX', '12/12/1980', '0-1842-3223-6', 1),
(2, 'A time to kill', 'Thomson Reuters', '04/01/1999', '0-9160-0872-X', 1),
(3, 'The House of Mirth', 'Penguin Random House', '06/08/2010', '0-1550-7146-7', 1),
(4, 'East of Eden', 'Hachette Livre', '30/03/2001', '0-2476-2936-7', 2),
(5, 'The Sun also rises', 'HarperCollins', '25/05/2015', '0-3335-1324-X', 2),
(6, 'Vile Bodies', 'Macmillan Publishers', '02/02/1996', '0-2954-2975-5', 2),
(7, 'A Scanner Darkly', 'Bertelsmann', '04/08/2005', '0-9556-1945-9', 3),
(8, 'MOAB is my Washpot', 'Scholastic Corporation', '30/06/1905', '0-1126-3913-5', 4),
(9, 'Number the Stars', 'McGraw-Hill Education', '23/07/2008', '0-5320-7144-1', 4),
(10, 'Noli me Tangere', 'Pearson', '13/09/2020', '0-6740-9536-7', 3),
(11, 'The Great Gatsby', 'F. Scott Fitzgerald', '1925-04-26', '978-0-306-40615-7', 1),
(12, 'The Catcher in the Rye', 'J. D. Salinger', '1951-09-26', '978-0-553-37804-3', 1),
(13, 'The Grapes of Wrath', 'John Steinbeck', '1939-04-26', '978-0-553-37804-3', 1),
(14, 'The Art of War', 'A.H. & Co.', '12/12/1980', '0-1842-3223-6', 1),
(15, 'The Book of Mormon', 'HarperCollins', '01/01/1905', '0-7356-0274-X', 4);

 * sqlite:///libraryDB.db
15 rows affected.

[]

In [61]:
%%sql
INSERT INTO branches (branchID, name, address, zipCode, city)
VALUES (1, 'Scranton Library', 'Soleveien 24', 1540, 'Vestby'),
(2, 'Akron Library', 'Øvre Strandgate 2', 6008, 'Ålesund'),
(3, 'Albany Library', 'Kongens gate 1', 1020, 'Oslo'),
(4, 'Nashua Library', 'Torsvegen 80', 5043, 'Gjøvik'),
(5, 'Biblioteket', 'Biblioteket', 1234, 'Oslo'),
(6, 'Biblioteca', 'Calle de la Biblioteca', 28001, 'Madrid');

 * sqlite:///libraryDB.db
6 rows affected.

[]

In [62]:
%%sql
INSERT INTO borrowers (borrowerID, firstName, lastName, address, zipCode, city, email, phoneNumber)
VALUES (1, 'Joakim', 'Edvardsen', 'Soleveien 24', 1540, 'Vestby', 'joakim@ntnu.no', 90159363),
(2, 'Eduard', 'Cristea', 'Karl Johans gate 1', 1020, 'Oslo', 'eduard@ntnu.no', 94560934),
(3, 'Torstein', 'Eide', 'Dronninsgate 87', 5043, 'Gjøvik', 'torstein@ntnu.no', 58394859),
(4, 'Richileu', 'Bailey', 'Larsgårsvegen 2', '5894', 'Trondheim', 'richie@ntnu.no', 49586710);

 * sqlite:///libraryDB.db
4 rows affected.

[]

In [64]:
%%sql
INSERT INTO lentBooks (bookID, dueDate, borrowerID)
VALUES (1, '02/12/2021', 1),
(2, '12/12/2021', 1),
(3, '03/12/2021', 2),
(4, '10/12/2021', 4),
(5, '07/12/2021', 3),
(6, '01/10/2022', 2);

 * sqlite:///libraryDB.db
6 rows affected.

[]

In [65]:
%%sql
INSERT INTO author (authorID, firstName, lastName)
VALUES (1, 'William', 'Shakespeare'),
(2, 'J.R.R.', 'Tolkien'),
(3, 'J.K.', 'Rowling'),
(4, 'Robert', 'C. Martin'),
(5, 'Leo', 'Tolstoy'),
(6, 'Jon', 'Nesbø'),
(7, 'Arthur', 'Conan Doyle'),
(8, 'Emily', 'Bronte'),
(9, 'Leonardo', 'da Vinci');

 * sqlite:///libraryDB.db
9 rows affected.

[]

In [72]:
%%sql
INSERT INTO bookAuthor (bookID, authorID)
VALUES (1, 1),
(2, 1),
(3, 5),
(3, 4),
(4, 2),
(5, 7),
(6, 8),
(7, 9),
(8, 2),
(9, 3),
(10, 2),
(11, 1),
(12, 5),
(13, 3);

 * sqlite:///libraryDB.db
14 rows affected.

[]

In [79]:
%%sql
INSERT INTO bookBranches (bookID, branchID)
VALUES (1, 1),
(2, 1),
(3, 1),
(4, 2),
(5, 2),
(6, 2),
(7, 3),
(8, 4),
(9, 4),
(10, 3),
(11, 4),
(12, 4),
(13, 4);

 * sqlite:///libraryDB.db
13 rows affected.

[]